jfazekas21/blackBird-ESP32-S3/components/JFS/Sample/Driver/NOR/ST_STM32L4R9/FS_NOR_HW_SPIFI_STM32L4R9_ST_STM32L4R9I_DISCO.c
/*********************************************************************
*                     SEGGER Microcontroller GmbH                    *
*                        The Embedded Experts                        *
**********************************************************************
*                                                                    *
*       (c) 2003 - 2022  SEGGER Microcontroller GmbH                 *
*                                                                    *
*       www.segger.com     Support: support_emfile@segger.com        *
*                                                                    *
**********************************************************************
*                                                                    *
*       emFile * File system for embedded applications               *
*                                                                    *
*                                                                    *
*       Please note:                                                 *
*                                                                    *
*       Knowledge of this file may under no circumstances            *
*       be used to write a similar product for in-house use.         *
*                                                                    *
*       Thank you for your fairness !                                *
*                                                                    *
**********************************************************************
*                                                                    *
*       emFile version: V5.18.1                                      *
*                                                                    *
**********************************************************************
----------------------------------------------------------------------
Licensing information
Licensor:                 SEGGER Microcontroller Systems LLC
Licensed to:              Cardinal Detecto, 102 East Daugherty St, Webb City, MO 64870
Licensed SEGGER software: emFile
License number:           FS-00842
License model:            SSL [Single Developer Single Platform Source Code License]
Licensed product:         -
Licensed platform:        Xtensa LX6 (ESP32), Eclipse
Licensed number of seats: 1
----------------------------------------------------------------------
Support and Update Agreement (SUA)
SUA period:               2022-03-24 - 2022-09-24
Contact to extend SUA:    sales@segger.com
-------------------------- END-OF-HEADER -----------------------------

File      : FS_NOR_HW_SPIFI_STM32L4R9_ST_STM32L4R9I_DISCO.c
Purpose   : Low-level flash driver for STM32L4R9 OCTASPI interface.
Literature:
  [1] RM0432 Reference manual STM32L4Rxxx and STM32L4Sxxx advanced Arm-based 32-bit MCUs
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32L4\RM0432_STM32L4Sxxx_L4Rxxx_Rev05.pdf)
  [2] Datasheet  STM32L4R5xx STM32L4R7xx STM32L4R9xx
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32L4\DS12023_STM32L4R5xx_Rev4.pdf)
  [3] STM32L4Rxxx STM32L4Sxxx Errata sheet
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32L4\ES0393_STM32L4R_Errata_rev3.pdf)
  [4] UM2271 User manual Discovery kit with STM32L4R9AI MCU
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32L4\Evalboard\STM32L4R9_DiscoveryKit\en.DM00421316.pdf)
  [5] Datasheet MX25LM51245G
    ("\\FILESERVER\Techinfo\Company\Macronix\SPI_NOR_Flash\MX25LM51245G, 3V, 512Mb, v1.1.pdf")
*/

/*********************************************************************
*
*       #include section
*
**********************************************************************
*/
#include "FS.h"

/*********************************************************************
*
*      Defines, configurable
*
**********************************************************************
*/
#ifndef   FS_NOR_HW_NOR_CLK_HZ
  #define FS_NOR_HW_NOR_CLK_HZ      30000000uL      // Frequency of the clock supplied to NOR flash device
#endif

#ifndef   FS_NOR_HW_USE_OS
  #define FS_NOR_HW_USE_OS          0               // Enables/disables the interrupt-driven operation.
#endif

/*********************************************************************
*
*       #include section, conditional
*
**********************************************************************
*/
#if FS_NOR_HW_USE_OS
  #include "RTOS.h"
  #include "stm32l4xx.h"
  #include "FS_OS.h"
#endif

/*********************************************************************
*
*       Defines, non-configurable
*
**********************************************************************
*/

/*********************************************************************
*
*       Octo-SPI registers
*/
#define OCTOSPI_BASE_ADDR       0xA0001400uL
#define OCTOSPI_CR              (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x000))
#define OCTOSPI_DCR1            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x008))
#define OCTOSPI_DCR2            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x00C))
#define OCTOSPI_DCR3            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x010))
#define OCTOSPI_SR              (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x020))
#define OCTOSPI_FCR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x024))
#define OCTOSPI_DLR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x040))
#define OCTOSPI_AR              (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x048))
#define OCTOSPI_DR              (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x050))
#define OCTOSPI_DR_BYTE         (*(volatile U8* )(OCTOSPI_BASE_ADDR + 0x050))
#define OCTOSPI_PSMKR           (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x080))
#define OCTOSPI_PSMAR           (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x088))
#define OCTOSPI_PIR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x090))
#define OCTOSPI_CCR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x100))
#define OCTOSPI_TCR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x108))
#define OCTOSPI_IR              (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x110))
#define OCTOSPI_ABR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x120))
#define OCTOSPI_LPTR            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x130))
#define OCTOSPI_WCCR            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x180))
#define OCTOSPI_WTCR            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x188))
#define OCTOSPI_WIR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x190))
#define OCTOSPI_WABR            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x1A0))
#define OCTOSPI_HLCR            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x200))

/*********************************************************************
*
*       Port G registers
*/
#define GPIOG_BASE_ADDR         0x48001800uL
#define GPIOG_MODER             (*(volatile U32*)(GPIOG_BASE_ADDR + 0x00))
#define GPIOG_OSPEEDR           (*(volatile U32*)(GPIOG_BASE_ADDR + 0x08))
#define GPIOG_PUPDR             (*(volatile U32*)(GPIOG_BASE_ADDR + 0x0C))
#define GPIOG_ODR               (*(volatile U32*)(GPIOG_BASE_ADDR + 0x14))
#define GPIOG_AFRH              (*(volatile U32*)(GPIOG_BASE_ADDR + 0x24))
#define GPIOG_AFRL              (*(volatile U32*)(GPIOG_BASE_ADDR + 0x20))

/*********************************************************************
*
*       Port H registers
*/
#define GPIOH_BASE_ADDR         0x48001C00uL
#define GPIOH_MODER             (*(volatile U32*)(GPIOH_BASE_ADDR + 0x00))
#define GPIOH_OSPEEDR           (*(volatile U32*)(GPIOH_BASE_ADDR + 0x08))
#define GPIOH_PUPDR             (*(volatile U32*)(GPIOH_BASE_ADDR + 0x0C))
#define GPIOH_ODR               (*(volatile U32*)(GPIOH_BASE_ADDR + 0x14))
#define GPIOH_AFRL              (*(volatile U32*)(GPIOH_BASE_ADDR + 0x20))
#define GPIOH_AFRH              (*(volatile U32*)(GPIOH_BASE_ADDR + 0x24))

/*********************************************************************
*
*       Port I registers
*/
#define GPIOI_BASE_ADDR         0x48002000uL
#define GPIOI_MODER             (*(volatile U32*)(GPIOI_BASE_ADDR + 0x00))
#define GPIOI_OSPEEDR           (*(volatile U32*)(GPIOI_BASE_ADDR + 0x08))
#define GPIOI_PUPDR             (*(volatile U32*)(GPIOI_BASE_ADDR + 0x0C))
#define GPIOI_ODR               (*(volatile U32*)(GPIOI_BASE_ADDR + 0x14))
#define GPIOI_AFRL              (*(volatile U32*)(GPIOI_BASE_ADDR + 0x20))
#define GPIOI_AFRH              (*(volatile U32*)(GPIOI_BASE_ADDR + 0x24))

/*********************************************************************
*
*       Reset and clock control
*/
#define RCC_BASE_ADDR           0x40021000uL
#define RCC_CFGR                (*(volatile U32*)(RCC_BASE_ADDR + 0x08))
#define RCC_AHB3RSTR            (*(volatile U32*)(RCC_BASE_ADDR + 0x30))
#define RCC_AHB1ENR             (*(volatile U32*)(RCC_BASE_ADDR + 0x48))
#define RCC_AHB2ENR             (*(volatile U32*)(RCC_BASE_ADDR + 0x4C))
#define RCC_AHB3ENR             (*(volatile U32*)(RCC_BASE_ADDR + 0x50))

/*********************************************************************
*
*       Power control
*/
#define PWR_BASE_ADDR           0x40007000uL
#define PWR_CR2                 (*(volatile U32*)(PWR_BASE_ADDR + 0x04))

/*********************************************************************
*
*       Masks for the peripheral enable bits
*/
#define AHB2ENR_GPIOGEN         6
#define AHB2ENR_GPIOHEN         7
#define AHB2ENR_GPIOIEN         8
#define AHB2ENR_OSPIMEN         20
#define AHB3ENR_OSPI2EN         9

/*********************************************************************
*
*       GPIO bit positions of SPI signals
*/
#define NOR_CS_BIT              12    // Port G
#define NOR_DQS_BIT             15    // Port G
#define NOR_CLK_BIT             6     // Port I
#define NOR_D0_BIT              11    // Port I
#define NOR_D1_BIT              10    // Port I
#define NOR_D2_BIT              9     // Port I
#define NOR_D3_BIT              8     // Port H
#define NOR_D4_BIT              9     // Port H
#define NOR_D5_BIT              10    // Port H
#define NOR_D6_BIT              9     // Port G
#define NOR_D7_BIT              10    // Port G

/*********************************************************************
*
*       GPIO bits and masks
*/
#define OSPEEDR_HIGH            0x2uL
#define OSPEEDR_MASK            0x3uL
#define MODER_ALT               0x2uL
#define MODER_MASK              0x3uL
#define AFR_MASK                0xFuL

/*********************************************************************
*
*       Octo-SPI control register
*/
#define CR_EN_BIT               0
#define CR_ABORT_BIT            1
#define CR_DMAEN_BIT            2
#define CR_TCEN_BIT             3
#define CR_FTHRES_BIT           8
#define CR_FTHRES_MASK          0x2Fu
#define CR_TRIE_BIT             16
#define CR_TCIE_BIT             17
#define CR_FTIE_BIT             18
#define CR_SMIE_BIT             19
#define CR_TOIE_BIT             20
#define CR_APMS_BIT             22
#define CR_FMODE_BIT            28
#define CR_FMODE_WRITE          0x00uL
#define CR_FMODE_READ           0x01uL
#define CR_FMODE_POLL           0x02uL
#define CR_FMODE_MMAP           0x03uL
#define CR_FMODE_MASK           0x03uL

/*********************************************************************
*
*       Octo-SPI device configuration register 1
*/
#define DCR1_CKMODE_BIT         0
#define DCR1_CSHT_BIT           8
#define DCR1_DEVSIZE_BIT        16
#define DCR1_DEVSIZE_MAX        0x1Fu

/*********************************************************************
*
*       Octo-SPI device configuration register 2
*/
#define DCR2_PRESCALER_BIT      0
#define DCR2_PRESCALER_MAX      0xFFu

/*********************************************************************
*
*       Octo-SPI status register
*/
#define SR_TEF_BIT              0
#define SR_TCF_BIT              1
#define SR_FTF_BIT              2
#define SR_SMF_BIT              3
#define SR_TOF_BIT              4
#define SR_BUSY_BIT             5
#define SR_FLEVEL_BIT           8
#define SR_FLEVEL_MASK          0x3Fu

/*********************************************************************
*
*       Octo-SPI communication configuration register
*/
#define CCR_IMODE_BIT           0
#define CCR_ADMODE_BIT          8
#define CCR_ADSIZE_BIT          12
#define CCR_ADSIZE_MASK         0x03uL
#define CCR_ABMODE_BIT          16
#define CCR_ABSIZE_BIT          20
#define CCR_ABSIZE_MASK         0x03uL
#define CCR_DMODE_BIT           24
#define CCR_DMODE_NONE          0x00uL
#define CCR_DMODE_SINGLE        0x01uL
#define CCR_DMODE_DUAL          0x02uL
#define CCR_DMODE_QUAD          0x03uL
#define CCR_DMODE_OCTO          0x04uL

/*********************************************************************
*
*       Octo-SPI timing configuration register
*/
#define TCR_DCYC_BIT            0
#define TCR_DCYC_MASK           0x0FuL
#define TCR_DHQC_BIT            28

/*********************************************************************
*
*       Misc. defines
*/
#define NUM_BYTES_FIFO          16
#define OCTOSPI_PRIO            15
#define WAIT_TIMEOUT_MS         1000
#define CYCLES_PER_MS           150           // Blocks the execution for about 1ms on a CPU running at 78 Mhz.
#define WAIT_TIMEOUT_CYCLES     (WAIT_TIMEOUT_MS * CYCLES_PER_MS)
#define CR2_IOSV_BIT            9
#define LOW_POWER_TIMEOUT       32

/*********************************************************************
*
*       Global data
*
**********************************************************************
*/
extern unsigned int SystemCoreClock;

/*********************************************************************
*
*      Static data
*
**********************************************************************
*/
static            U32 _ClkDiv;
#if FS_NOR_HW_USE_OS
  static volatile U32 _StatusOSPI;
#endif

/*********************************************************************
*
*      Static code
*
**********************************************************************
*/

/*********************************************************************
*
*       _CalcClockDivider
*/
static U32 _CalcClockDivider(U32 * pFreq_Hz) {
  U32 Div;
  U32 Freq_Hz;
  U32 MaxFreq_Hz;
  U32 PerClkFreq_Hz;
  U32 AHBPre;
  U32 HPre;

  //
  // Calculate the frequency of the clock supplied to QSPI peripheral.
  //
  HPre          = (RCC_CFGR >> 4) & 0x0FuL;
  AHBPre        = (HPre & 0x08) ? 2uL << (HPre & 0x07) : 1uL;
  PerClkFreq_Hz = (SystemCoreClock / AHBPre);
  //
  // Calculate the divider for the specified QSPI frequency.
  //
  Div        = 0;
  MaxFreq_Hz = *pFreq_Hz;
  for (;;) {
    Freq_Hz = PerClkFreq_Hz / (Div + 1u);
    if (Freq_Hz <= MaxFreq_Hz) {
      break;
    }
    ++Div;
    if (Div == DCR2_PRESCALER_MAX) {
      break;
    }
  }
  *pFreq_Hz = Freq_Hz;
  return Div;
}

/*********************************************************************
*
*       _GetMode
*/
static U32 _GetMode(unsigned BusWidth, U32 NumBytes) {
  U32 Mode;

  Mode = CCR_DMODE_NONE;
  if (NumBytes) {
    switch (BusWidth) {
    case 1:
      Mode = CCR_DMODE_SINGLE;
      break;
    case 2:
      Mode = CCR_DMODE_DUAL;
      break;
    case 4:
      Mode = CCR_DMODE_QUAD;
      break;
    case 8:
      Mode = CCR_DMODE_OCTO;
      break;
    default:
      break;
    }
  }
  return Mode;
}

/*********************************************************************
*
*       _GetNumCycles
*/
static U32 _GetNumCycles(unsigned BusWidth, U32 NumBytes) {
  U32 NumCycles;

