jfazekas21/blackBird-ESP32-S3/components/JFS/Sample/Driver/NOR/ST_STM32L4R9/FS_NOR_HW_SPIFI_STM32L4R9_ST_STM32L4R9I_DISCO.c
  NumCycles = 0;
  if (NumBytes) {
    NumCycles = NumBytes << 3;        // Assume 8-bits per byte.
    switch (BusWidth) {
    case 2:
      NumCycles >>= 1;
      break;
    case 4:
      NumCycles >>= 2;
      break;
    default:
      break;
    }
  }
  return NumCycles;
}

/*********************************************************************
*
*       _WaitForTransferComplete
*/
static int _WaitForTransferComplete(void) {
  int r;
  U32 Status;

  r = 0;              // Set to indicate success.
#if FS_NOR_HW_USE_OS
  for (;;) {
    Status = _StatusOSPI;
    if (Status & (1uL << SR_TCF_BIT)) {
      break;
    }
    r = FS_X_OS_Wait(WAIT_TIMEOUT_MS);
    if (r != 0) {
      break;
    }
  }
#else
  U32 TimeOut;

  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    Status = OCTOSPI_SR;
    if (Status & (1uL << SR_TCF_BIT)) {
      break;
    }
    if (--TimeOut == 0) {
      r = 1;
      break;
    }
  }
#endif
  return r;
}

/*********************************************************************
*
*       _WaitForData
*/
static int _WaitForData(U32 NumBytesExpected) {
  int r;
  U32 Status;
  U32 NumBytesAvail;

  r = 0;              // Set to indicate success.
#if FS_NOR_HW_USE_OS
  for (;;) {
    Status = _StatusOSPI;
    NumBytesAvail = (Status >> SR_FLEVEL_BIT) & SR_FLEVEL_MASK;
    if ((NumBytesAvail >= 4) || (NumBytesAvail >= NumBytesExpected)) {
      break;
    }
    r = FS_X_OS_Wait(WAIT_TIMEOUT_MS);
    if (r != 0) {
      break;
    }
  }
#else
  U32 TimeOut;

  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    Status = OCTOSPI_SR;
    NumBytesAvail = (Status >> SR_FLEVEL_BIT) & SR_FLEVEL_MASK;
    if ((NumBytesAvail >= 4) || (NumBytesAvail >= NumBytesExpected)) {
      break;
    }
    if (--TimeOut == 0) {
      r = 1;
      break;
    }
  }
#endif // FS_NOR_HW_USE_OS
  return r;
}

/*********************************************************************
*
*       _WaitForFreeSpace
*/
static int _WaitForFreeSpace(U32 NumBytesExpected) {
  int r;
  U32 Status;
  U32 NumBytesFree;

  r = 0;              // Set to indicate success.
#if FS_NOR_HW_USE_OS
  for (;;) {
    Status = _StatusOSPI;
    NumBytesFree = (Status >> SR_FLEVEL_BIT) & SR_FLEVEL_MASK;
    NumBytesFree = NUM_BYTES_FIFO - NumBytesFree;
    if ((NumBytesFree >= 4) || (NumBytesFree >= NumBytesExpected)) {
      break;
    }
    r = FS_X_OS_Wait(WAIT_TIMEOUT_MS);
    if (r != 0) {
      break;
    }
  }
#else
  U32 TimeOut;

  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    Status = OCTOSPI_SR;
    NumBytesFree = (Status >> SR_FLEVEL_BIT) & SR_FLEVEL_MASK;
    NumBytesFree = NUM_BYTES_FIFO - NumBytesFree;
    if ((NumBytesFree >= 4) || (NumBytesFree >= NumBytesExpected)) {
      break;
    }
    if (--TimeOut == 0) {
      r = 1;
      break;
    }
  }
#endif // FS_NOR_HW_USE_OS
  return r;
}

/*********************************************************************
*
*       _ClearFlags
*/
static void _ClearFlags(void) {
  OCTOSPI_FCR = 0
              | (1uL << SR_TEF_BIT)
              | (1uL << SR_TCF_BIT)
              | (1uL << SR_SMF_BIT)
              | (1uL << SR_TOF_BIT)
              ;
  //
  // Wait for the flags to be cleared.
  //
  for (;;) {
    if ((OCTOSPI_SR & ((1uL << SR_TEF_BIT) |
                       (1uL << SR_TCF_BIT) |
                       (1uL << SR_SMF_BIT) |
                       (1uL << SR_TOF_BIT))) == 0) {
      break;
    }
  }
}

/*********************************************************************
*
*       _Cancel
*/
static void _Cancel(void) {
  if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) != 0) {
    OCTOSPI_CR |= 1uL << CR_ABORT_BIT;
    _WaitForTransferComplete();
    OCTOSPI_FCR = 1uL << SR_TCF_BIT;
    for (;;) {
      if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
        break;
      }
    }
  }
}

/*********************************************************************
*
*       _Reset
*/
static void _Reset(void) {
  RCC_AHB3RSTR |=  (1uL << AHB3ENR_OSPI2EN);
  RCC_AHB3RSTR &= ~(1uL << AHB3ENR_OSPI2EN);
  OCTOSPI_CR   = 0
               | (1uL << CR_EN_BIT)                       // Enable the Octo-SPI unit.
               | (1uL << CR_TCEN_BIT)                     // Enable the timeout for the memory mapped read operations.
               ;
  OCTOSPI_DCR1 = 0                                        // Note 1
               | (DCR1_DEVSIZE_MAX << DCR1_DEVSIZE_BIT)   // We set the NOR flash size to maximum since this value is not known at this stage.
               | (2uL              << DCR1_CSHT_BIT)      // This was taken from an ST sample.
               ;
  OCTOSPI_DCR2 = 0
               | (_ClkDiv << DCR2_PRESCALER_BIT)          // Configure the clock frequency of the NOR flash.
               ;
  OCTOSPI_TCR  = 0
               | (1uL << TCR_DHQC_BIT)                    // This was taken from an ST sample.
               ;
  OCTOSPI_LPTR = LOW_POWER_TIMEOUT;
#if FS_NOR_HW_USE_OS
  //
  // Clear interrupt flags and enable the interrupt.
  //
  OCTOSPI_CR  |= 0
              | (1uL << CR_APMS_BIT)
              | (1uL << CR_TRIE_BIT)
              | (1uL << CR_TCIE_BIT)
              | (1uL << CR_SMIE_BIT)
              | (1uL << CR_TOIE_BIT)
              ;
  OCTOSPI_FCR  = 0
               | (1uL << SR_SMF_BIT)
               | (1uL << SR_TOF_BIT)
               | (1uL << SR_FTF_BIT)
               | (1uL << SR_TCF_BIT)
               | (1uL << SR_TEF_BIT)
               ;
  _StatusOSPI = 0;
#endif // FS_NOR_HW_USE_OS
}

/*********************************************************************
*
*       _ReadDataViaCPU
*/
static int _ReadDataViaCPU(U8 * pData, U32 NumBytes) {
  int r;
  U32 DataReg;

  do {
    //
    // Wait for the data to be received.
    //
    r = _WaitForData(NumBytes);
    if (r != 0) {
      break;
    }
    //
    // Read data and store it to destination buffer.
    //
    if (NumBytes < 4) {
      //
      // Read single bytes.
      //
      do {
        *pData++ = OCTOSPI_DR_BYTE;
      } while (--NumBytes);
    } else {
      //
      // Read 4 bytes at a time.
      //
      DataReg = OCTOSPI_DR;
      *pData++ = (U8)DataReg;
      *pData++ = (U8)(DataReg >> 8);
      *pData++ = (U8)(DataReg >> 16);
      *pData++ = (U8)(DataReg >> 24);
      NumBytes -= 4u;
    }
  } while (NumBytes != 0u);
  return r;
}

/*********************************************************************
*
*       _WriteDataViaCPU
*/
static int _WriteDataViaCPU(const U8 * pData, U32 NumBytes) {
  int r;
  U32 DataReg;

  do {
    //
    // Wait for free space in FIFO.
    //
    r = _WaitForFreeSpace(NumBytes);
    if (r != 0) {
      break;
    }
    //
    // Get the data from source buffer and write it.
    //
    if (NumBytes < 4u) {
      //
      // Write single bytes.
      //
      do {
        OCTOSPI_DR_BYTE = *pData++;
      } while (--NumBytes);
    } else {
      //
      // Write 4 bytes at a time if possible.
      //
      DataReg  = (U32)*pData++;
      DataReg |= (U32)*pData++ << 8;
      DataReg |= (U32)*pData++ << 16;
      DataReg |= (U32)*pData++ << 24;
      NumBytes -= 4u;
      OCTOSPI_DR = DataReg;
    }
  } while (NumBytes != 0u);
  return r;
}

/*********************************************************************
*
*      Public code (via callback)
*
**********************************************************************
*/

/*********************************************************************
*
*       _HW_Init
*
*  Function description
*    HW layer function. It is called before any other function of the physical layer.
*    It should configure the HW so that the other functions can access the NOR flash.
*
*  Return value
*    Frequency of the SPI clock in Hz.
*
*  Notes
*    (1) We configure the data transfer in Mode 0 (CLK must stay low while nCS is high)
*        because of the errata "2.7.6  Write data lost with clock mode 3" in [3].
*/
static int _HW_Init(U8 Unit) {
  U32 Freq_Hz;

  FS_USE_PARA(Unit);
  //
  // Enable the clocks of peripherals and reset them.
  //
  RCC_AHB2ENR  |= 0
               | (1uL << AHB2ENR_GPIOGEN)
               | (1uL << AHB2ENR_GPIOHEN)
               | (1uL << AHB2ENR_GPIOIEN)
               | (1uL << AHB2ENR_OSPIMEN)
               ;
  RCC_AHB3ENR  |=  (1uL << AHB3ENR_OSPI2EN);
  //
  // Wait for the unit to exit reset.
  //
  for (;;) {
    if ((RCC_AHB3RSTR & (1uL << AHB3ENR_OSPI2EN)) == 0) {
      break;
    }
  }
  //
  // CS is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOG_MODER   &= ~(MODER_MASK   << ( NOR_CS_BIT       << 1));
  GPIOG_MODER   |=  (MODER_ALT    << ( NOR_CS_BIT       << 1));
  GPIOG_AFRH    &= ~(AFR_MASK     << ((NOR_CS_BIT - 8)  << 2));
  GPIOG_AFRH    |=  (0x5uL        << ((NOR_CS_BIT - 8)  << 2));
  GPIOG_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_CS_BIT       << 1));
  GPIOG_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_CS_BIT       << 1));
  //
  // DQS is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOG_MODER   &= ~(MODER_MASK   << ( NOR_DQS_BIT      << 1));
  GPIOG_MODER   |=  (MODER_ALT    << ( NOR_DQS_BIT      << 1));
  GPIOG_AFRH    &= ~(AFR_MASK     << ((NOR_DQS_BIT - 8) << 2));
  GPIOG_AFRH    |=  (0x5uL        << ((NOR_DQS_BIT - 8) << 2));
  GPIOG_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_DQS_BIT      << 1));
  GPIOG_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_DQS_BIT      << 1));
  //
  // CLK is an output signal controlled by the OCTOSPI unit.
  //
  GPIOI_MODER   &= ~(MODER_MASK   << ( NOR_CLK_BIT      << 1));
  GPIOI_MODER   |=  (MODER_ALT    << ( NOR_CLK_BIT      << 1));
  GPIOI_AFRL    &= ~(AFR_MASK     << ((NOR_CLK_BIT - 0) << 2));
  GPIOI_AFRL    |=  (0x5uL        << ((NOR_CLK_BIT - 0) << 2));
  GPIOI_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_CLK_BIT      << 1));
  GPIOI_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_CLK_BIT      << 1));
  //
  // D0 is an input/output signal controlled by the OCTOSPI unit.
  //
  GPIOI_MODER   &= ~(MODER_MASK   << ( NOR_D0_BIT      << 1));
  GPIOI_MODER   |=  (MODER_ALT    << ( NOR_D0_BIT      << 1));
  GPIOI_AFRH    &= ~(AFR_MASK     << ((NOR_D0_BIT - 8) << 2));
  GPIOI_AFRH    |=  (0x5uL        << ((NOR_D0_BIT - 8) << 2));
  GPIOI_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D0_BIT      << 1));
  GPIOI_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D0_BIT      << 1));
  //
  // D1 is an input/output signal controlled by the OCTOSPI unit.
  //
  GPIOI_MODER   &= ~(MODER_MASK   << ( NOR_D1_BIT      << 1));
  GPIOI_MODER   |=  (MODER_ALT    << ( NOR_D1_BIT      << 1));
  GPIOI_AFRH    &= ~(AFR_MASK     << ((NOR_D1_BIT - 8) << 2));
  GPIOI_AFRH    |=  (0x5uL        << ((NOR_D1_BIT - 8) << 2));
  GPIOI_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D1_BIT      << 1));
  GPIOI_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D1_BIT      << 1));
  //
  // D2 is an input/output signal and is controlled by the OCTOSPI unit.
  //
  GPIOI_MODER   &= ~(MODER_MASK   << ( NOR_D2_BIT      << 1));
  GPIOI_MODER   |=  (MODER_ALT    << ( NOR_D2_BIT      << 1));
  GPIOI_AFRH    &= ~(AFR_MASK     << ((NOR_D2_BIT - 8) << 2));
  GPIOI_AFRH    |=  (0x5uL        << ((NOR_D2_BIT - 8) << 2));
  GPIOI_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D2_BIT      << 1));
  GPIOI_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D2_BIT      << 1));
  //
  // D3 is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOH_MODER   &= ~(MODER_MASK   << ( NOR_D3_BIT      << 1));
  GPIOH_MODER   |=  (MODER_ALT    << ( NOR_D3_BIT      << 1));
  GPIOH_AFRH    &= ~(AFR_MASK     << ((NOR_D3_BIT - 8) << 2));
  GPIOH_AFRH    |=  (0x5uL        << ((NOR_D3_BIT - 8) << 2));
  GPIOH_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D3_BIT      << 1));
  GPIOH_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D3_BIT      << 1));
  //
  // D4 is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOH_MODER   &= ~(MODER_MASK   << ( NOR_D4_BIT      << 1));
  GPIOH_MODER   |=  (MODER_ALT    << ( NOR_D4_BIT      << 1));
  GPIOH_AFRH    &= ~(AFR_MASK     << ((NOR_D4_BIT - 8) << 2));
  GPIOH_AFRH    |=  (0x5uL        << ((NOR_D4_BIT - 8) << 2));
  GPIOH_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D4_BIT      << 1));
  GPIOH_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D4_BIT      << 1));
  //
  // D5 is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOH_MODER   &= ~(MODER_MASK   << ( NOR_D5_BIT      << 1));
  GPIOH_MODER   |=  (MODER_ALT    << ( NOR_D5_BIT      << 1));
  GPIOH_AFRH    &= ~(AFR_MASK     << ((NOR_D5_BIT - 8) << 2));
  GPIOH_AFRH    |=  (0x5uL        << ((NOR_D5_BIT - 8) << 2));
  GPIOH_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D5_BIT      << 1));
  GPIOH_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D5_BIT      << 1));
  //
  // D6 is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOG_MODER   &= ~(MODER_MASK   << ( NOR_D6_BIT      << 1));
  GPIOG_MODER   |=  (MODER_ALT    << ( NOR_D6_BIT      << 1));
  GPIOG_AFRH    &= ~(AFR_MASK     << ((NOR_D6_BIT - 8) << 2));
  GPIOG_AFRH    |=  (0x5uL        << ((NOR_D6_BIT - 8) << 2));
  GPIOG_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D6_BIT      << 1));
  GPIOG_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D6_BIT      << 1));
  //
  // D7 is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOG_MODER   &= ~(MODER_MASK   << ( NOR_D7_BIT      << 1));
  GPIOG_MODER   |=  (MODER_ALT    << ( NOR_D7_BIT      << 1));
  GPIOG_AFRH    &= ~(AFR_MASK     << ((NOR_D7_BIT - 8) << 2));
  GPIOG_AFRH    |=  (0x5uL        << ((NOR_D7_BIT - 8) << 2));
  GPIOG_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D7_BIT      << 1));
  GPIOG_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D7_BIT      << 1));
  //
  // Enable the power of the GPIO G.
  //
  PWR_CR2 |= (1uL << CR2_IOSV_BIT);
#if FS_NOR_HW_USE_OS
  //
  // Disable the interrupt and configure the priority.
  //
  NVIC_DisableIRQ(OCTOSPI2_IRQn);
  NVIC_SetPriority(OCTOSPI2_IRQn, OCTOSPI_PRIO);
#endif // FS_NOR_HW_USE_OS
  //
  // Initialize the Octo-SPI controller.
  //
  Freq_Hz = FS_NOR_HW_NOR_CLK_HZ;
  _ClkDiv = _CalcClockDivider(&Freq_Hz);
  _Reset();
#if FS_NOR_HW_USE_OS
  NVIC_EnableIRQ(OCTOSPI2_IRQn);
#endif // FS_NOR_HW_USE_OS
  return (int)Freq_Hz;
}

/*********************************************************************
*
*       _HW_SetCmdMode
*
*  Function description
*    HW layer function. It enables the direct access to NOR flash via SPI.
*    This function disables the memory-mapped mode.
*/
static void _HW_SetCmdMode(U8 Unit) {
  FS_USE_PARA(Unit);            // This device has only one HW unit.

  //
  // Cancel the memory mode so that the BUSY bit goes to 0
  // and we can write to OCTOSPI_CCR register.
  //
  if ((OCTOSPI_CR & (CR_FMODE_MASK << CR_FMODE_BIT)) == (CR_FMODE_MMAP << CR_FMODE_BIT)) {
    _Cancel();
  }
  _Reset();
}

/*********************************************************************
*
*       _HW_SetMemMode
*
*  Function description
*    HW layer function. It enables the memory-mapped mode. In this mode
*    the data can be accessed by doing read operations from memory.
*    The HW is responsible to transfer the data via SPI.
*    This function disables the direct access to NOR flash via SPI.
*/
static void _HW_SetMemMode(U8 Unit, U8 ReadCmd, unsigned NumBytesAddr, unsigned NumBytesDummy, U16 BusWidth) {
  U32 CfgReg;
  U32 CtrlReg;
  U32 CmdMode;
  U32 AddrMode;
  U32 DataMode;
  U32 NumCyclesDummy;
  U32 AddrSize;
  U32 TCfgReg;

  FS_USE_PARA(Unit);            // This device has only one HW unit.
  AddrSize = 0;
  if (NumBytesAddr) {
     AddrSize = (NumBytesAddr - 1) & CCR_ADSIZE_MASK;
  }
  NumCyclesDummy = _GetNumCycles(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesDummy);  // The dummy bytes are sent using the data mode.
  CmdMode        = _GetMode(FS_BUSWIDTH_GET_CMD(BusWidth), sizeof(ReadCmd));
  AddrMode       = _GetMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAddr);
  DataMode       = _GetMode(FS_BUSWIDTH_GET_DATA(BusWidth), 1);                   // We read at least one byte.
  CfgReg = 0
         | (DataMode << CCR_DMODE_BIT)
         | (AddrSize << CCR_ADSIZE_BIT)
         | (AddrMode << CCR_ADMODE_BIT)
         | (CmdMode  << CCR_IMODE_BIT)
         ;
  CtrlReg  =   OCTOSPI_CR;
  CtrlReg &= ~(CR_FMODE_MASK << CR_FMODE_BIT);
  CtrlReg |=   CR_FMODE_MMAP << CR_FMODE_BIT;
  TCfgReg  =   OCTOSPI_TCR;
  TCfgReg &= ~(TCR_DCYC_MASK  << TCR_DCYC_BIT);
  TCfgReg |=   NumCyclesDummy << TCR_DCYC_BIT;
  //
  // Wait until the unit is ready for the new command.
  //
  for (;;) {
    if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
      break;
    }
  }
  _ClearFlags();
  OCTOSPI_CR  = CtrlReg;
  OCTOSPI_TCR = TCfgReg;
  OCTOSPI_AR  = 0;
  OCTOSPI_CCR = CfgReg;
  OCTOSPI_IR  = ReadCmd;
}

/*********************************************************************
*
*       _HW_ExecCmd
*
*  Function description
*    HW layer function. It requests the NOR flash to execute a simple command.
*    The HW has to be in SPI mode.
*/
static void _HW_ExecCmd(U8 Unit, U8 Cmd, U8 BusWidth) {
  U32 CfgReg;
  U32 CtrlReg;
  U32 CmdMode;

