jfazekas21/blackBird-ESP32-S3/components/JFS/Sample/Driver/NOR/ST_STM32L4R9/FS_NOR_HW_SPIFI_STM32L4R9_ST_STM32L4R9I_DISCO.c
  FS_USE_PARA(Unit);    // This device has only one HW unit.
  //
  // Fill local variables.
  //
  CmdMode = _GetMode(BusWidth, sizeof(Cmd));
  CfgReg  = 0
          | (CmdMode << CCR_IMODE_BIT)
          ;
  CtrlReg  = OCTOSPI_CR;
  CtrlReg &= ~(CR_FMODE_MASK  << CR_FMODE_BIT);
  CtrlReg |=   CR_FMODE_WRITE << CR_FMODE_BIT;
  //
  // Wait until the unit is ready for the new command.
  //
  for (;;) {
    if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
      break;
    }
  }
  //
  // Execute the command.
  //
  _ClearFlags();
  OCTOSPI_CR  = CtrlReg;
  OCTOSPI_DLR = 0;
  OCTOSPI_ABR = 0;
  OCTOSPI_CCR = CfgReg;
  OCTOSPI_IR  = Cmd;
  //
  // Wait until the command has been completed.
  //
  for (;;) {
    if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
      break;
    }
  }
}

/*********************************************************************
*
*       _HW_ReadData
*
*  Function description
*    HW layer function. It transfers data from NOR flash to MCU.
*    The HW has to be in SPI mode.
*/
static void _HW_ReadData(U8 Unit, U8 Cmd, const U8 * pPara, unsigned NumBytesPara, unsigned NumBytesAddr, U8 * pData, unsigned NumBytesData, U16 BusWidth) {
  U32 AddrReg;
  U32 AltReg;
  U32 CfgReg;
  U32 CtrlReg;
  U32 DataMode;
  U32 AddrMode;
  U32 AltMode;
  U32 CmdMode;
  U32 AltSize;
  U32 AddrSize;
  U32 NumBytes;
  U32 NumBytesAlt;
  U32 NumBytesToRead;

  FS_USE_PARA(Unit);    // This device has only one HW unit.
  //
  // Fill local variables.
  //
  AddrReg     = 0;
  AltReg      = 0;
  NumBytesAlt = NumBytesPara - NumBytesAddr;
  CmdMode     = _GetMode(FS_BUSWIDTH_GET_CMD(BusWidth), sizeof(Cmd));
  AddrMode    = _GetMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAddr);
  AltMode     = _GetMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAlt);
  DataMode    = _GetMode(FS_BUSWIDTH_GET_DATA(BusWidth), NumBytesData);
  //
  // Encode the address.
  //
  if (NumBytesAddr) {
    NumBytes = NumBytesAddr;
    do {
      AddrReg <<= 8;
      AddrReg  |= (U32)(*pPara++);
    } while (--NumBytes);
  }
  //
  // Encode the dummy and mode bytes.
  //
  if (NumBytesPara > NumBytesAddr) {
    NumBytes = NumBytesAlt;
    do {
      AltReg <<= 8;
      AltReg  |= (U32)(*pPara++);
    } while (--NumBytes);
  }
  AddrSize = 0;
  if (NumBytesAddr) {
    AddrSize = (NumBytesAddr - 1) & CCR_ADSIZE_MASK;
  }
  AltSize = 0;
  if (NumBytesAlt) {
    AltSize = (NumBytesAlt - 1) & CCR_ABSIZE_MASK;
  }
  CfgReg = 0
         | (DataMode << CCR_DMODE_BIT)
         | (AltSize  << CCR_ABSIZE_BIT)
         | (AltMode  << CCR_ABMODE_BIT)
         | (AddrSize << CCR_ADSIZE_BIT)
         | (AddrMode << CCR_ADMODE_BIT)
         | (CmdMode  << CCR_IMODE_BIT)
         ;
  CtrlReg  = OCTOSPI_CR;
  CtrlReg &= ~(CR_FMODE_MASK << CR_FMODE_BIT);
  CtrlReg |=   CR_FMODE_READ << CR_FMODE_BIT;
  //
  // Wait until the unit is ready for the new command.
  //
  for (;;) {
    if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
      break;
    }
  }
  //
  // Execute the command.
  //
  _ClearFlags();
#if FS_NOR_HW_USE_OS
  _StatusOSPI = 0;
#endif // FS_NOR_HW_USE_OS
  NumBytesToRead = NumBytesData - 1;        // We have to subtract 1 because 0 means "read 1 byte".
  if (NumBytesData) {
    OCTOSPI_DLR = NumBytesToRead;
  }
  OCTOSPI_CR  = CtrlReg;
  OCTOSPI_ABR = AltReg;
  OCTOSPI_CCR = CfgReg;
  if (NumBytesAddr) {
    OCTOSPI_IR = Cmd;
    OCTOSPI_AR = AddrReg;
  } else {
    OCTOSPI_IR = Cmd;
  }
  //
  // Read data from NOR flash.
  //
  if (NumBytesData != 0u) {
    (void)_ReadDataViaCPU(pData, NumBytesData);
  }
  //
  // Wait until the data transfer has been completed.
  //
  (void)_WaitForTransferComplete();
}

/*********************************************************************
*
*       _HW_WriteData
*
*  Function description
*    HW layer function. It transfers data from MCU to NOR flash.
*    The HW has to be in SPI mode.
*/
static void _HW_WriteData(U8 Unit, U8 Cmd, const U8 * pPara, unsigned NumBytesPara, unsigned NumBytesAddr, const U8 * pData, unsigned NumBytesData, U16 BusWidth) {
  U32 AddrReg;
  U32 AltReg;
  U32 CfgReg;
  U32 CtrlReg;
  U32 DataMode;
  U32 AddrMode;
  U32 AltMode;
  U32 CmdMode;
  U32 AddrSize;
  U32 AltSize;
  U32 NumBytes;
  U32 NumBytesAlt;

  FS_USE_PARA(Unit);    // This device has only one HW unit.
  //
  // Fill local variables.
  //
  AddrReg     = 0;
  AltReg      = 0;
  NumBytesAlt = NumBytesPara - NumBytesAddr;
  CmdMode     = _GetMode(FS_BUSWIDTH_GET_CMD(BusWidth), sizeof(Cmd));
  AddrMode    = _GetMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAddr);
  AltMode     = _GetMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAlt);
  DataMode    = _GetMode(FS_BUSWIDTH_GET_DATA(BusWidth), NumBytesData);
  //
  // Encode the address.
  //
  if (NumBytesAddr) {
    NumBytes = NumBytesAddr;
    do {
      AddrReg <<= 8;
      AddrReg  |= (U32)(*pPara++);
    } while (--NumBytes);
  }
  //
  // Encode the dummy and mode bytes.
  //
  if (NumBytesPara > NumBytesAddr) {
    NumBytes = NumBytesAlt;
    do {
      AltReg <<= 8;
      AltReg  |= (U32)(*pPara++);
    } while (--NumBytes);
  }
  AddrSize = 0;
  if (NumBytesAddr) {
    AddrSize = NumBytesAddr - 1;
  }
  AltSize = 0;
  if (NumBytesAlt) {
    AltSize = NumBytesAlt - 1;
  }
  CfgReg = 0
         | (DataMode << CCR_DMODE_BIT)
         | (AltSize  << CCR_ABSIZE_BIT)
         | (AltMode  << CCR_ABMODE_BIT)
         | (AddrSize << CCR_ADSIZE_BIT)
         | (AddrMode << CCR_ADMODE_BIT)
         | (CmdMode  << CCR_IMODE_BIT)
         ;
  CtrlReg  = OCTOSPI_CR;
  CtrlReg &= ~(CR_FMODE_MASK  << CR_FMODE_BIT);
  CtrlReg |=   CR_FMODE_WRITE << CR_FMODE_BIT;
  //
  // Wait until the unit is ready for the new command.
  //
  for (;;) {
    if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
      break;
    }
  }
  //
  // Execute the command.
  //
#if FS_NOR_HW_USE_OS
  _StatusOSPI = 0;
#endif // FS_NOR_HW_USE_OS
  _ClearFlags();
  if (NumBytesData != 0u) {
    OCTOSPI_DLR = NumBytesData - 1;       // 0 means "write 1 byte".
  }
  OCTOSPI_CR  = CtrlReg;
  OCTOSPI_ABR = AltReg;
  OCTOSPI_CCR = CfgReg;
  if (NumBytesAddr) {
    OCTOSPI_IR = Cmd;
    OCTOSPI_AR = AddrReg;
  } else {
    OCTOSPI_IR = Cmd;
  }
  //
  // Write data to NOR flash.
  //
  if (NumBytesData) {
    (void)_WriteDataViaCPU(pData, NumBytesData);
  }
  //
  // Wait until the data transfer has been completed.
  //
  (void)_WaitForTransferComplete();
}

/*********************************************************************
*
*       _HW_Poll
*
*  Function description
*    HW layer function. Sends a command repeatedly and checks the
*    response for a specified condition.
*
*  Return value
*    > 0    Timeout occurred.
*    ==0    OK, bit set to specified value.
*    < 0    Feature not supported.
*
*  Additional information
*    The function executes periodically a command and waits
*    until specified bit in the response returned by the NOR flash
*    is set to a value specified by BitValue. The position of the bit
*    that has to be checked is specified by BitPos where 0 is the
*    position of the least significant bit in the byte.
*/
static int _HW_Poll(U8 Unit, U8 Cmd, U8 BitPos, U8 BitValue, U32 Delay, U32 TimeOut_ms, U16 BusWidth) {
  int r;

  FS_USE_PARA(Unit);
  r = -1;                 // Set to indicate that the feature is not supported.
#if FS_NOR_HW_USE_OS
  {
    U32 CfgReg;
    U32 CtrlReg;
    U32 DataMode;
    U32 CmdMode;
    U32 NumBytes;
    U32 DataMask;
    U32 DataMatch;
    U32 Status;

    //
    // Fill local variables.
    //
    DataMask    = 1uL           << BitPos;
    DataMatch   = (U32)BitValue << BitPos;
    Delay     <<= 4;          // 16 clock cycles are required to transfer 2 bytes.
    NumBytes    = 1;          // The response consists of only one byte.
    CmdMode     = _GetMode(FS_BUSWIDTH_GET_CMD(BusWidth), sizeof(Cmd));
    DataMode    = _GetMode(FS_BUSWIDTH_GET_DATA(BusWidth), NumBytes);
    CfgReg = 0
           | (DataMode << CCR_DMODE_BIT)
           | (CmdMode  << CCR_IMODE_BIT)
           ;
    CtrlReg  =   OCTOSPI_CR;
    CtrlReg &= ~(CR_FMODE_MASK << CR_FMODE_BIT);
    CtrlReg |=   CR_FMODE_POLL << CR_FMODE_BIT;
    //
    // Wait until the unit is ready for the new command.
    //
    for (;;) {
      if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
        break;
      }
    }
    //
    // Start the poll operation. The end of operation is signaled by interrupt.
    //
    _ClearFlags();
    _StatusOSPI = 0;
    if (NumBytes) {
      OCTOSPI_DLR = NumBytes - 1;             // 0 means "read 1 byte".
    }
    OCTOSPI_CR    = CtrlReg;
    OCTOSPI_PSMKR = DataMask;
    OCTOSPI_PSMAR = DataMatch;
    OCTOSPI_PIR   = Delay;
    OCTOSPI_FCR   = 1uL << SR_SMF_BIT;
    OCTOSPI_CCR   = CfgReg;
    OCTOSPI_IR    = Cmd;
    for (;;) {
      Status = _StatusOSPI;
      if (Status & (1uL << SR_SMF_BIT)) {
        r = 0;                                // Bit set to the requested value.
        break;
      }
      r = FS_X_OS_Wait(TimeOut_ms);
      if (r != 0) {
        //
        // The timeout has expired. Cancel the poll operation.
        //
        _Cancel();
        r = 1;                                // A timeout occurred.
        break;
      }
    }
  }
#else
  FS_USE_PARA(Cmd);
  FS_USE_PARA(BitPos);
  FS_USE_PARA(BitValue);
  FS_USE_PARA(Delay);
  FS_USE_PARA(TimeOut_ms);
  FS_USE_PARA(BusWidth);
#endif
  return r;
}

/*********************************************************************
*
*       _HW_Delay
*
*  Function description
*    HW layer function. Blocks the execution for the specified number
*    of milliseconds.
*/
static int _HW_Delay(U8 Unit, U32 ms) {
  int r;

  FS_USE_PARA(Unit);
  r = -1;                 // Set to indicate that the feature is not supported.
#if FS_NOR_HW_USE_OS
  if (ms) {
    FS_X_OS_Delay(ms);
    r = 0;
  }
#else
  FS_USE_PARA(ms);
#endif
  return r;
}

/*********************************************************************
*
*       _HW_Lock
*
*  Function description
*    HW layer function. Requests exclusive access to the SPI bus.
*/
static void _HW_Lock(U8 Unit) {
  FS_USE_PARA(Unit);
}

/*********************************************************************
*
*       _HW_Unlock
*
*  Function description
*    HW layer function. Releases the exclusive access of the SPI bus.
*
*  Additional information
*    The configuration of the quad SPI controller has to be saved and
*    later restored in the _HW_Lock() function if the application
*    changes it.
*/
static void _HW_Unlock(U8 Unit) {
  FS_USE_PARA(Unit);
}

/*********************************************************************
*
*       Public data
*
**********************************************************************
*/
#if FS_NOR_HW_USE_OS

/*********************************************************************
*
*       OCTOSPI2_IRQHandler
*/
void OCTOSPI2_IRQHandler(void);
void OCTOSPI2_IRQHandler(void) {
  U32 Status;

  OS_EnterInterrupt();
  Status       = OCTOSPI_SR;
  _StatusOSPI |= Status;
  OCTOSPI_FCR  = Status;            // Prevent other interrupts from occurring.
  FS_X_OS_Signal();
  OS_LeaveInterrupt();
}

#endif // FS_NOR_HW_USE_OS

/*********************************************************************
*
*       Global data
*
**********************************************************************
*/
const FS_NOR_HW_TYPE_SPIFI FS_NOR_HW_SPIFI_STM32L4R9_ST_STM32L4R9I_DISCO = {
  _HW_Init,
  _HW_SetCmdMode,
  _HW_SetMemMode,
  _HW_ExecCmd,
  _HW_ReadData,
  _HW_WriteData,
  _HW_Poll,
  _HW_Delay,
  _HW_Lock,
  _HW_Unlock,
  NULL,
  NULL,
  NULL,
  NULL,
  NULL
};

/*************************** End of file ****************************/
